export const improvements1 = [
  {
    id: 1,
    name: 'Мінімізація та запобігання викидів шкідливих речовин в атмосферу шляхом застосування промисловими підприємствами екологічних фільтрів.',
    result: 'Покращення якості повітря за рахунок роботи фільтрів',
  },
  {
    id: 2,
    name: 'Збільшення площі зелених зон загального користування та озеленених територій',
    result: 'Покращення рівня повітря на території, що озеленили',
  },
  {
    id: 3,
    name: 'Розробка екологічно орієнтованого законодавства та програми.',
    result: 'Збільшення можливостей та заходів направлених на покращення стану повітря',
  },
  {
    id: 4,
    name: 'Проведення інформаційних кампаній (в т.ч. соціальна реклама, телепередачі тощо)',
    result: 'Підвищення рівня екологічної свідомості населення',
  },
];

export const improvements2 = [
  {
    id: 1,
    name: 'Мінімізація та запобігання викидів шкідливих речовин у воду шляхом застосування промисловими підприємствами екологічних фільтрів.',
    result: 'Покращення якості води за рахунок роботи фільтрів',
  },
  {
    id: 2,
    name: 'Будівництво очисних споруд для очищення зливових стоків і талих вод',
    result: 'Покращення якості води за рахунок роботи очисних споруд',
  },
  {
    id: 3,
    name: 'Розробка схем комплексного використання й охорони водних ресурсів',
    result: 'Покращення якості води, та збільшення методів очистки води',
  },
  {
    id: 4,
    name: 'Проведення інформаційних кампаній (в т.ч. соціальна реклама, телепередачі тощо)',
    result: 'Підвищення рівня екологічної свідомості населення',
  },
];

export const improvements3 = [
  {
    id: 1,
    name: 'Оптимізація обробітку ґрунту',
    result: 'Збільшення родючості, зменшення забруднення',
  },
  {
    id: 2,
    name: 'Використання хімічних речовин-інактиваторів, які знижують токсичну дію важких металів.',
    result: 'Зменшення забруднення тяжкими металами',
  },
  {
    id: 3,
    name: 'Профілактика забруднення',
    result: 'Зменшення забруднення тяжкими металами',
  },
];

export const improvements4 = [
  {
    id: 1,
    name: 'Розроблення та реалізація національного плану щодо збільшення кількості будівель з близьким до нульового рівнем споживання енергії та стратегії термомодернізації будівель',
    result: 'Покращення енергетичного стану, поява енерго-економних будинків',
  },
  {
    id: 2,
    name: 'Стимулювання зменшення споживання енергії у будівлях',
    result: 'Покращення енергетичного стану',
  },
];
