export const systems = [
  {
    _id: 1,
    name: 'Стан повітря',
    values: ['PM1', 'PM2.5', 'PM10', 'температура', 'вологість', 'тиск', 'AQI PM2.5', 'діоксид азоту', 'чадний газ', 'діоксид сірки', 'оксиду азоту', 'оксиду вуглецю', 'сульфатна кислота', 'вуглецю діоксид', 'ацетальдегід', 'етилацетат'],
  },
  {
    _id: 2,
    name: 'Рівень радіації',
    values: ['γ-Радіація'],
  },
  {
    _id: 3,
    name: 'Стан води',
    values: ['каламутність', 'забарвленість', 'Запах, бали при', 'смак', 'жорсткість', 'марганець', 'амоній', 'сухий залишок', 'окиснюваність', 'відмітка про відповідність', 'кислота оцтова ', 'спирт метиловий', 'метан', 'хлор', 'водневий показник'],
  },
  {
    _id: 4,
    name: 'Стан грунтів',
    values: ['бор', 'кобальт', 'мідь', 'цинк', 'молібден', 'коефіцієнт фільтрації', 'залізо', 'діоксид мангану', 'речовини у вигляді суспендованих твердих частинок'],
  },
  {
    _id: 5,
    name: 'Енергетичний стан',
    values: ['використання газу', 'використання електроенергії'],
  },
  {
    _id: 6,
    name: 'Економічний стан',
    values: ['оренда квартир', 'зупинка/станція', 'злочинність', 'органи поліції', 'здоров’я', 'забруднення', 'освіта', 'тарифи ЖКХ', 'чистий прибуток', 'сплачено податків', 'виробництво', 'середня зарплата', 'реальний дохід', 'ВВП', 'індекс'],
  },
  {
    _id: 7,
    name: 'Стан здоров’я',
    values: ['забезпеченість', 'темпи росту захворюваності', 'лікарі', 'медсестри', 'молодшого медичного персоналу', 'кількість ліжок'],
  },
];
