export const types = [
  { id: 1, value: 'good' },
  { id: 2, value: 'normal' },
  { id: 3, value: 'danger' },
];

export const identification = [
  {
    id: 1,
    name: 'Станція №143',
  },
  {
    id: 2,
    name: '№ станції не вказано',
  },
  {
    id: 3,
    name: 'ДУ «Київський міський центр контролю та профілактики хвороб МОЗ України»',
  },
  {
    id: 4,
    name: `Статус – працює<br>
      Опис скважини – є можливість підключення до генератора<br>
      Властність – Свердловина  СВКП "Київводфонд"<br>`,
  },
  {
    id: 5,
    name: 'Територія для оцінки грунтів',
  },
  {
    id: 6,
    name: 'Дошкільний навчальний заклад',
  },
  {
    id: 7,
    name: 'Квартира, що здається в аренду',
  },
  {
    id: 8,
    name: 'Державне підприємство спиртової та лікеро-горілчаної промисловості',
  },
  {
    id: 9,
    name: 'КНП виконавчого органу Київської міської ради',
  },
  {
    id: 10,
    name: 'Місто для оцінки економічних показників',
  },
];

export const parameters = [
  { id: 1, name: 'PM1', value: '2.5 мкг/м³' },
  { id: 2, name: 'PM2.5', value: '3.1 мкг/м³' },
  { id: 3, name: 'PM10', value: '5.7 мкг/м³' },
  { id: 4, name: 'Температура', value: '5.5 °C' },
  { id: 5, name: 'Відносна вологість', value: '57.7%' },
  { id: 6, name: 'Атмосферний тиск', value: '1006.7 гПа' },
  { id: 7, name: 'AQI PM2.5', value: 13, type: 1 },
];

export const parameters2 = [
  { id: 8, name: 'PM1', value: '11 мкг/м³' },
  { id: 9, name: 'PM2.5', value: '15.2 мкг/м³' },
  { id: 10, name: 'PM10', value: '35.8 мкг/м³' },
  { id: 11, name: 'Температура', value: '1.6 °C' },
  { id: 12, name: 'Відносна вологість', value: '64.8 %' },
  { id: 13, name: 'Атмосферний тиск', value: '1006 гПа' },
  { id: 14, name: 'Діоксид азоту (NO₂)', value: '27 мкг/м³' },
  { id: 15, name: 'Чадний газ (CO)', value: '0.23 мг/м³' },
  { id: 16, name: 'Діоксид сірки (SO₂)', value: '7.71 мкг/м³' },
  { id: 17, name: 'Зважені частки (пил)', value: '28,6 мкг/м3' },
  { id: 18, name: 'Оксиду азоту', value: '12,4 мкг/м3' },
  { id: 19, name: 'Оксиду вуглецю', value: '297 мкг/м3' },
  { id: 20, name: 'γ-радіація', value: '115 нЗв/год' },
  { id: 21, name: 'AQI PM2.5', value: 53, type: 2 },
];

export const parameters3 = [{ id: 22, name: 'γ-Радіація (нЗв/год)', value: 100, type: 1 }];

export const parameters4 = [
  { id: 23, name: 'Каламутність, мг/дм3', value: '0' },
  { id: 24, name: 'Забарвленість', value: '0,92' },
  { id: 25, name: 'Запах, бали при 20С', value: '0' },
  { id: 26, name: 'Запах, бали при 60С', value: '0' },
  { id: 27, name: 'Смак та присмак', value: '0' },
  { id: 28, name: 'pH, водневий показник', value: '7,47' },
  { id: 29, name: 'Загальна жорсткість, ммоль/дм3', value: '2,45' },
  { id: 30, name: 'Марганець, мг/дм3', value: '0,013' },
  { id: 32, name: 'Амоній, мг/дм3', value: '0,26' },
  { id: 33, name: 'Сухий залишок', value: '380' },
  { id: 34, name: 'Перманганатна окиснюваність', value: '1,65' },
  { id: 35, name: 'Відмітка про відповідність', value: 'відповідає', type: 1 },
];

export const parameters5 = [
  { id: 36, name: 'Бор', value: 'від 0 до 5 - Нижня порогова концентрація', type: 3 },
  { id: 37, name: 'Кобальт', value: 'від 1 до 5 - Нижня порогова концентрація', type: 3 },
  { id: 39, name: 'Мідь', value: 'від 0 до 5 - Нижня порогова концентрація', type: 3 },
  { id: 40, name: 'Цинк', value: 'від 30 до 60 – Нормальний вміст', type: 2 },
  { id: 41, name: 'Молібден', value: 'від 2,4 до 3,2 – Нормальний вміст', type: 2 },
  { id: 42, name: 'Азото (N2)', value: '', type: 1 },
  { id: 43, name: 'Фосфор (P2)', value: '', type: 1 },
  { id: 44, name: 'Калій (K3)', value: '', type: 1 },
  { id: 45, name: 'Коефіцієнт фільтрації (для орного горизонту)', value: '0,0003-0,0007см/сек' },
];

export const parameters6 = [
  { id: 46, name: 'Використання газу за січень 2023 р.', value: '3807 м3' },
  { id: 47, name: 'Використання газу за лютий 2023 р.', value: '3750 м3' },
  { id: 48, name: 'Використання електроенергії за січень 2023 р.', value: '3128 кВт/год' },
  { id: 49, name: 'Використання електроенергії за лютий 2023 р.', value: '602 кВт/год' },
];

export const parameters7 = [
  { id: 50, name: 'Оренда квартир', value: '410 грн/м2' },
  { id: 51, name: 'Зупинка/станція', value: 'поряд', type: 1 },
  { id: 52, name: 'Злочинність', value: 'крадіжки(1), злочини середньої тяжкості(1), тяжкі злочини(1)' },
  { id: 53, name: 'Органи поліції', value: 'поряд', type: 1 },
  { id: 54, name: 'Здоров’я', value: 'українська дитяча спеціалізована лікарня ‘ОХМАТДИТ’ (поряд)', type: 1 },
  { id: 55, name: 'Забруднення', value: 'дані відсутні' },
  {
    id: 56,
    name: 'Освіта',
    value: 'гімназія №153(поряд), київський професійно-педагогічний коледж ім. Антона Макаренка(поряд)',
    type: 1,
  },
  {
    id: 57,
    name: 'Тарифи',
    value: `утримання будинків, споруд та земельних ділянок – 2,86 грн/м2<br>
 водопостачання – 6,11 грн/м2<br>
  водовідведення – 4,71 грн/м2<br>
  опалення – 26,36 грн/м2<br>
  енергопостачання – 90 коп/кВт*год<br>
  `,
  },
];

export const parameters9 = [
  { id: 75, name: 'Забезпеченість комплектами індивідуального захисту на тиждень', value: '100%' },
  { id: 76, name: 'Забезпеченість ШВЛ', value: '12 шт.' },
  { id: 77, name: 'Забезпеченість тестами', value: '217 шт.' },
  { id: 78, name: 'Темпи росту захворюваності', value: '199 чол.' },
  { id: 79, name: 'Всі лікарі', value: '15 чол.' },
  { id: 80, name: 'Всі медсестри', value: '24 чол.' },
  { id: 81, name: 'Молодшого медичного персоналу', value: '24 чол.' },
];

export const parameters8 = [
  { id: 58, name: 'Залізо та його сполуки (у перерахунку на залізо)', value: '0.008928' },
  { id: 59, name: 'Манган та його сполуки (у перерахунку на діоксид мангану )', value: '0.000526' },
  { id: 60, name: 'Речовини у вигляді суспендованих твердих частинок (мікрочастинки та волокна )', value: '50.144947' },
  { id: 61, name: 'Оксиду азоту (у перерахунку на діоксид азоту [NO + NО2])', value: '22.164426' },
  { id: 63, name: 'Діоксид сірки', value: '0.00072' },
  { id: 64, name: 'Сульфатна кислота (H2SO4) [сірка]', value: '0.00072' },
  { id: 65, name: 'Оксиду вуглецю', value: '41.773824' },
  { id: 66, name: 'Вуглецю діоксид', value: '26665.348374' },
  { id: 68, name: 'Ацетальдегід', value: '0.137997' },
  { id: 69, name: 'Етилацетат', value: '0.027772' },
  { id: 70, name: 'Кислота оцтова', value: '0.072059' },
  { id: 71, name: 'Спирт метиловий', value: '0.011059' },
  { id: 72, name: 'Метан', value: '1.107265' },
  { id: 73, name: 'Хлор та сполуки хлору (у перерахунку на хлор)', value: '0.70191' },
  { id: 74, name: 'Водню хлорид (соляна кислота за молекулою HCL)', value: '0.001739' },
];

export const parameters10 = [
  { id: 82, name: 'Середня зарплата', value: '20,658 тис. грн/міс.' },
  { id: 83, name: 'Реальний дохід', value: '53 тис. грн/рік.' },
  { id: 84, name: 'ВВП', value: '238,6 тис. грн' },
  { id: 85, name: 'Індекси промислової продукції', value: '104,8%' },
  { id: 86, name: 'Індекси сільськогосподарської продукції', value: '98,2%' },
  { id: 87, name: 'Індекс будівельної продукції', value: '104%' },
  { id: 88, name: 'Індекс споживчих цін', value: '100,6%' },
  { id: 89, name: 'Індекс цін виробників промислової продукції', value: '107,3%' },
];

export const parameters11 = [
  { id: 90, name: 'γ-Радіація ', value: '140 нЗв/год' },
  { id: 91, name: 'Використання газу за Жовтень', value: '6,52 Гкал' },
  { id: 92, name: 'Використання газу за листопад', value: '48,98 Гкал' },
  { id: 93, name: 'Використання газу за грудень', value: '46,9 Гкал' },
  { id: 94, name: 'Використання газу за січень 2023 р.', value: '42,77 Гкал' },
  { id: 95, name: 'Використання газу за лютий 2023 р.', value: '49,25 Гкал' },
  { id: 96, name: 'Використання електроенергії за Жовтень', value: '8072 кВт/год' },
  { id: 97, name: 'Використання електроенергії за листопад', value: '4937 кВт/год' },
  { id: 98, name: 'Використання електроенергії за грудень', value: '4600 кВт/год' },
  { id: 99, name: 'Використання електроенергії за січень 2023 р.', value: '3775 кВт/год' },
  { id: 100, name: 'Використання електроенергії за лютий 2023 р.', value: '6708 кВт/год' },
  { id: 101, name: 'Чистий прибуток', value: '21 млн. грн.' },
  { id: 102, name: 'Сплачено податків', value: '307 млн. грн.' },
  { id: 103, name: 'Виробництво спирту', value: '3,3 млн. дал.' },
  { id: 104, name: 'Темпи росту захворюваності', value: '137 чол.' },
  { id: 105, name: 'Всі лікарі', value: '10 чол.' },
  { id: 106, name: 'Всі медсестри', value: '18 чол.' },
  { id: 107, name: 'Молодшого медичного персоналу', value: '17 чол.' },
  { id: 108, name: 'Кількість ліжок', value: '115 шт.' },
];

export const markers = [
  {
    name: 'Станція для визначення рівня забруднення атмосферного повітря',
    identification_id: 1,
    address: 'м. Київ, вулиця Волоська, 43',
    coordinates: [50.471031886528294, 30.51289857360725],
    parameters: [1, 2, 3, 4, 5, 6, 7],
  },
  {
    name: 'Станція для визначення рівня забруднення атмосферного повітря',
    identification_id: 2,
    address: 'м. Київ, Харківське шосе, 7/1',
    coordinates: [50.42294384396571, 30.446125427948928],
    parameters: [8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21],
  },
  {
    name: 'Станція для визначення радіаційного фону',
    identification_id: 3,
    address: 'м. Київ, вулиця Миколи Закревського',
    coordinates: [50.49690831614808, 30.58993388237443],
    parameters: [22],
  },
  {
    name: 'Бювет у місті Києві',
    identification_id: 4,
    address: 'м. Київ, вулиця Васильківська, 47',
    coordinates: [50.49690831614808, 30.58993388237443],
    parameters: [23, 24, 25, 26, 27, 28, 29, 30, 32, 33, 34, 35],
  },
  {
    name: 'Батьківщина-Мати',
    identification_id: 5,
    address: 'м. Київ, вулиця Лаврська, 27',
    coordinates: [50.42661914304253, 30.562947847036543],
    parameters: [36, 37, 38, 39, 40, 41, 42, 43, 44, 45],
  },
  {
    name: 'Лісова пісня',
    identification_id: 6,
    address: 'м. Бровари, вулиця Соборна, 3',
    coordinates: [50.55466287536796, 30.64419614358455],
    parameters: [46, 47, 48, 49],
  },
  {
    name: 'Будинок без назви',
    identification_id: 7,
    address: 'м. Бровари, вулиця В’ячеслава Чорновола, 25',
    coordinates: [50.45306523594108, 30.484914948373415],
    parameters: [50, 51, 52, 53, 54, 55, 56, 57],
  },
  {
    name: 'УКРСПИРТ',
    identification_id: 8,
    address: 'м. Бровари, вулиця Героїв України, 16',
    coordinates: [50.51161695689877, 30.788627413124146],
    parameters: [58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 104, 105, 106, 107, 108],
  },
  {
    name: 'Київський міський центр нефрології та діалізу',
    identification_id: 9,
    address: 'м. Київ, вулиця Петра Запорожця, 26',
    coordinates: [50.4772376518123, 30.60221919863027],
    parameters: [75, 76, 77, 78, 79, 80, 81],
  },
  {
    name: 'місто Київ',
    identification_id: 10,
    address: 'м. Київ, Майдан Незалежності',
    coordinates: [50.4495382555955, 30.525422556705447],
    parameters: [82, 83, 84, 85, 86, 87, 88, 89],
  },
];
